sample_rate = 44100

"""int: Target sample rate during feature extraction"""

window_size = 2048
"""int: Size of FFT window"""

overlap = 1024
"""int: Amount of overlap between frames"""

mel_bins = 64
"""int: Number of Mel bins"""

kmax = 3

labels = ['A调曲笛C0280', 'G调新笛C0281', 'G调梆笛C0237', '三弦T0289','中国大鼓D0248',
 '中胡L0297','中虎D0273','中阮T0260','中音加键唢呐C0259','中音板胡L0240','中音笙C0263',
 '二弦L0285','二胡L0266', '云锣D0279', '五音排鼓D0252', '传统笙C0244', '低音加键唢呐C0257',
 '低音笙C0264', '侗笛C0316', '俄比C0311', '傈僳族奇奔T0302', '六角高胡L0292', '北梆子D0246',
 '南梆子D0245', '南音三弦T0295', '南音二弦L0293', '南音琵琶T0294', '古筝T0255', '吐良C0308',
 '唢呐C0296', '埙C0283', '大镲D0290', '小堂鼓D0250', '小锣D0275', '小镲D0271', '小闷笛C0303',
 '巴乌C0310', '德C0305', '扁八角高胡L0291', '扁鼓D0251', '扬琴T0267', '抄锣D0272', 
 '拉祜族葫芦笙C0306', '斗锣D0284', '曲锣D0286', '木鱼D0277', '板鼓D0278', '柳琴T0261', '椰胡L0288',  '武锣D0274', '洞巴C0304','深波D0287', '澜沧小三弦T0300', '牛角琴L0312', '牛铃D0299', '独弦琴T0317',
 '独弦胡L0313', '玎T0301', '琵琶T0262', '碰铃D0247', '竹排琴D0315', '箜篌T0254', '管子C0265',
 '箫C0282', '编磬D0242', '编钟D0241', '编铓D0298', '芦笙C0307', '花盆鼓D0249', '草帽镲D0268',
 '葫芦丝C0309', '葫芦琴L0314', '铙D0269', '铙钹D0270', '雷琴L0256', '马锣D0276', '高音板胡L0239',
 '高音键笙C0243']

lb_to_ix = {lb: i for i, lb in enumerate(labels)}
ix_to_lb = {i: lb for i, lb in enumerate(labels)}

corrupted_files = []
